Unit/src/Enums/ItemTypes/ItemTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="85fc740a-0bba-4bcd-8ca3-447d426c14ed">
  <name>ItemTypes</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="4be789f8-2d36-4169-9f2d-4c825c8d712c">
    <name>Service</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7bbe3a49-8365-4785-a38c-abee4d666e13">
    <name>Product</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Unit/src/Catalogs/Items/Items.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Items</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ItemType</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Unit</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>MainPricture</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ItemID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>PackageUnit</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Unit/src/Catalogs/ItemKeys/ItemKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ItemKeys</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Item</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Unit</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Specification</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>AffectPricingMD5</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>UniqueMD5</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ItemKeyID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>SpecificationAffectPricingMD5</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>AffectPricingMD5</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Unit/src/CommonModules/Unit_DataGenerator/Module.bsl
#Region Info

Function Tests() Export
	TestList = New Array;
	TestList.Add("CreateItems");
	Return TestList;
EndFunction

#EndRegion

#Region Items

Function CreateItems() Export
	Data = GenerateDataForAccessTest();
	Return "";
EndFunction

#EndRegion

#Region Service

Function GenerateDataForAccessTest()
	
	Data = New Structure;
	Data.Insert("ItemType", Catalogs.ItemTypes.GetRef(New UUID("11111111-1111-1111-1111-111111111111")));
	Data.Insert("Unit", Catalogs.Units.GetRef(New UUID("11111111-1111-1111-1111-111111111111")));
	Data.Insert("ItemList", New Array);
	
	//@skip-check reading-attribute-from-database
	If Not IsBlankString(Data.ItemType.DataVersion) Then
		Return Data;
	EndIf;
	
	ItemType = Catalogs.ItemTypes.CreateItem();
	ItemType.Description_en = "DG. Item type";	
	ItemType.SetNewObjectRef(Data.ItemType);
	ItemType.Type = Enums.ItemTypes.Product;
	ItemType.Write();
	
	Unit = Catalogs.Units.CreateItem();
	Unit.Description_en = "DG. Unit";	
	Unit.SetNewObjectRef(Data.Unit);
	Unit.Write();
	
	CommonFunctionsClientServer.ShowUsersMessage("Item. Start date: " + CurrentSessionDate());
	For Index = 0 To 10000 Do
		Item = Catalogs.Items.CreateItem();
		Item.Description_en = "DG. Item: " + Index;	
		Item.ItemType = Data.ItemType;
		Item.Unit = Data.Unit;
		Item.Write();
		
		Str = New Structure;
		Str.Insert("Item", Item.Ref);
		Str.Insert("ItemKey", Catalogs.ItemKeys.EmptyRef());
		Str.Insert("Barcode", "");
		Data.ItemList.Add(Str);
	EndDo;
	CommonFunctionsClientServer.ShowUsersMessage("Item. End date: " + CurrentSessionDate());

	CommonFunctionsClientServer.ShowUsersMessage("Item key. Start date: " + CurrentSessionDate());
	For Index = 0 To Data.ItemList.Count() - 1 Do
		Row = Data.ItemList[Index];
		ItemKey = Catalogs.ItemKeys.CreateItem();
		ItemKey.Description_en = "DG. Item key: " + Index;	
		ItemKey.Item = Row.Item;
		ItemKey.Write();
		
		Row.ItemKey = ItemKey.Ref;
	EndDo;
	CommonFunctionsClientServer.ShowUsersMessage("Item key. End date: " + CurrentSessionDate());
	
	CommonFunctionsClientServer.ShowUsersMessage("Barcode. Start date: " + CurrentSessionDate());
	For Index = 0 To Data.ItemList.Count() - 1 Do
		Row = Data.ItemList[Index];
		Barcode = "DG" + Format(Index, "ND=12; NLZ=; NG=;");
		
		Reg = InformationRegisters.Barcodes.CreateRecordManager();
		Reg.Barcode = Barcode;
		Reg.ItemKey = Row.ItemKey;
		Reg.Unit = Data.Unit;
		Reg.Write();
		Row.Barcode = Barcode;
	EndDo;
	CommonFunctionsClientServer.ShowUsersMessage("Barcode. End date: " + CurrentSessionDate());
	
	Return Data;
EndFunction

Procedure AddAccessRow(AccessGroup, Key, Ref, Modify)
	NewRow = AccessGroup.ObjectAccess.Add();
	NewRow.Key = Key;
	NewRow.ValueRef = Ref;
	NewRow.Modify = Modify;
EndProcedure

#EndRegion
